'''1. Найти сумму и произведение цифр трехзначного числа,
    которое вводит пользователь.'''

num = input('Введите число: ')

sum = 0
prod = 1

for f in num:
    sum += int(f)
    prod *= int(f)
print(f"Сумма цифр числа {num}: {sum}")
print(f"Произведение цифр {num}: {prod}")

